import java.util.Arrays;
import java.util.List;

/**
 * Created by moon on 21/11/2016.
 *
 * @Description:
 */
public class Stream {
    public static void main(String[] args) {
        String[] bookArray = {"阿兰的战争", "野蛮大陆", "所有我们看不见的光", "被淹没和被拯救的", "我是女兵，也是女人（精装）", "零年：1945", "生存与命运（上下）", "五号屠场", "伊斯坦布尔逃亡", "来自纳粹地狱的报告", "巴黎烧了吗?", "拥抱战败", "元素周期表", "偷书贼", "朗读者", "朱可夫", "钢琴师", "The Book Thief", "抗日战争正面战场（上中下）", "战起1938", "平民如何变成屠夫", "战争就是这么回事儿（下）", "二战的决定性战役(德国观点)", "这里的黎明静悄悄", "二战回忆录（上下）", "偷书贼", "裸者与死者", "柏林日记", "冈村宁次回忆录", "第五號屠宰場", "天鹅奏鸣曲", "遥远的桥", "史迪威与美国在中国的经验（1911-1945）", "银翼夜枭02：莉莉娅同志", "希特勒的民族帝国", "无命运的人生", "凯旋门", "兄弟连", "战争风云", "The Nightingale", "破晓的军队", "国家记忆", "第三共和国的崩溃", "美国、俄国和冷战", "异域1945", "中国抗日战争正面战场作战记", "《耶路撒冷的艾希曼》:伦理的现代困境", "生死朗读", "根西岛文学与土豆皮馅饼俱乐部", "战犯参谋", "丘吉尔:第二次世界大战回忆录", "斯大林的战争", "丘吉尔文集:思想与经历", "史迪威与美国在中国的经验", "艾哈德·劳斯大将东线回忆录", "银翼夜枭03：伍尔夫与莉莉娅", "從俾斯麥到希特勒", "寒鸦行动", "呼吸秋千", "复仇女神", "日本帝国衰亡史：1936—1945（全4册）", "夜", "咖喱香肠的诞生", "奥斯维辛集中营的志愿者", "二战史诗三部曲", "第三帝国的兴亡（上下册）", "遥远的桥", "若非此时，何时？", "All the Light We Cannot See", "极端的年代：1914～1991", "少年H", "日本陆军的轨迹（1931—1945）", "上海秘密战", "不折之鹰", "我的奋斗", "死亡特雷布林卡", "第二次世界大战战史（全二册）", "穿条纹衣服的男孩", "茫茫黑夜", "The Book Thief", "希特勒－我的奮鬥", "父亲的战场", "东史郎日记", "太平洋战争与日本新闻", "纳粹德国的兴亡", "安妮日记", "中途岛海战", "一寸河山一寸血.4", "大东亚战争全史（全四册）", "Night", "靖国问题", "昭和时代见证录", "往事", "东进（套装共2册）", "朱可夫", "苏菲的选择", "辛德勒名单", "铁丝网上的小花", "风暴岛", "时间箭", "无辜者", "一寸河山一寸血.3", "在我们奥斯维辛", "拉贝日记", "战争与回忆：1941－1945（上下）", "爱与黑暗", "英国病人", "兄弟连", "逃离奥斯维辛", "日本帝国的衰亡（上下册）", "解读希特勒", "永遠的0", "二战军服全记录", "天鹅奏鸣曲", "一寸河山一寸血.5", "代号D机关Ⅲ", "一寸河山一寸血.2", "从乞丐到元首（上下）", "军国的幕僚", "巨人的碰撞", "日本最漫长的一天", "燃烧的岛群(上下)", "突破缅北的鹰", "华北治安战（上）", "大国之魂", "滿洲 安寧飯店", "雅尔塔", "忧郁星期天", "纳粹德国（上下册）", "这里的黎明静悄悄", "纳粹德国", "第三帝国的艺术博物馆", "战争风云：1939－1941（上下）", "山的那一边", "Eichmann in Jerusalem", "别问我是谁", "丘吉尔传", "一个背叛日本的日本人", "中途岛奇迹", "Skin of the Nation", "隆美尔战时文件", "狗日的战争", "缅甸战役", "纳粹与理发师", "悲喜边缘的旅馆", "国家记忆", "十年与二十天", "Night", "武神与将军", "辛德勒的名单", "战争史研究", "闪击英雄", "焦点不太准", "钢琴师", "The Rise and Fall of the Third Reich", "密室", "绞刑架下的报告", "尊严不是无代价的", "失去的胜利", "贼城", "二战图文史", "战后东北接收交涉纪实", "Embracing Defeat", "黎明的炮声", "第三帝国内幕", "Bloodlands", "纳粹上台前后我的生活回忆", "幼狮", "爷爷的天使", "德国通史", "辛德勒名单", "海因里希·希姆莱与妻书信集", "柏林1945", "两次世界大战之间的国际关系", "无命运的人生", "第二次世界大战的回顾与省思", "战时日记", "海的沉默", "生而有罪——纳粹子女访谈录", "德语课", "第一次世界大战战史", "寻访“二战”德国兵", "卡廷惨案真相", "奇迹年代", "步兵攻击", "怒江之战：大结局", "战斗的日子", "孤獨前哨", "国际事务概览.第二次世界大战（全11卷）", "Slaughterhouse-Five", "联合舰队", "第三帝国的兴亡（全四册）", "艾森豪威尔", "The Rape of Nanking", "第二次世界大战的起源", "菊花与锚", "西线无战事", "Maus", "中日战争时期的通敌内幕1937-1945（上下）", "汉娜的手提箱", "逆天而行", "地狱绝杀", "我十五岁，还不想死", "Savage Continent", "一个人的遭遇", "战争与回忆", "最后一役", "安妮日记", "滇缅公路", "战场上的蒲公英", "焦土:苏德战争(1943-1944)", "狗娘养的战争-巴顿将军自传", "重庆往事", "一个德国人的故事", "纳粹德国“企业共同体”劳资关系模式研究", "雪白血红", "二战史", "铁皮鼓", "春天的十七个瞬间", "日本帝国海军兴亡史（上下）", "进攻日本", "第二次世界大战回忆录", "大独裁者希特勒", "父辈的旗帜", "战地情书", "祖国", "1944：腾冲之围", "线", "朗读者", "第二次世界大战战史", "战后欧洲史", "像自由一样美丽", "国破山河在", "鼠族（一、二部）", "第三帝国的兴亡（全三册）", "罪孽的报应", "留德十年", "第三帝国的兴亡（上中下）", "西线无战事", "伤痕（增补版）", "三岛蜷伏 日月重光", "青铜骑士", "希特勒的私人图书馆", "告密者", "新编剑桥世界近代史(十二)", "第二次世界大战中的德国海军战略", "第三帝国的兴亡（共三册）", "我是馬拉拉", "我的反间谍生涯", "那些拯救我们的人", "从甲午到七七", "缅北之战", "人性的证明新编", "现在可以说了--美国制造首批原子弹的故事", "二战日本陆军单兵装备", "里斯本之夜", "国家阴谋3：梵蒂冈忏悔者", "虎贲万岁", "祖國", "不朽的光荣－第二次中日战争史", "战争与回忆（共四册）", "驼峰航线", "The Night Watch", "战争回忆录", "罗斯福与丘吉尔", "提琴里的手稿", "天皇的玉音放送", "安妮的日记", "第一次世界大战回忆录（全五卷）", "每当想起你", "自由的孩子", "Alan Turing", "Ordinary Men", "Uniforms of the Third Reich", "急电：北方四岛的呼叫", "青铜骑士", "虎部队：国民党抗日王牌七十四军", "无路可退的战士", "德国反犹史", "太平洋战争", "大东亚战争的总结", "回归", "亲爱的邦尼", "中国事变陆军作战史", "河豚鱼计划", "希特勒的战争谋略", "燃烧的岛群", "希特勒时代的孩子们", "太阳帝国", "阁楼上的狐狸", "巴顿将军战争回忆录", "战争总动员", "我是日军翻译官", "The Reader", "东线", "帝国骑士（第1卷）", "国家阴谋4：维也纳死亡事件", "二战美国陆军单兵装备", "不该被遗忘的人们", "邓尼茨元帅战争回忆录", "战争：日本人记忆中的二战", "剑拔弩张的盟友", "亲历兄弟连", "耶路撒冷的艾希曼", "我们的奋斗", "苏德战争", "失焦", "我的诺曼底", "最后的胜利", "安娜的新大衣", "上帝呀，你挨过饿吗？", "苏菲的选择", "曼施泰因元帅战争回忆录", "生者与死者", "二战风云4：地狱之门", "图文第二次世界大战史 39卷", "密码传奇", "战争风云（1-3）", "Year Zero", "安妮日记", "希特勒与20世纪德国", "Maus II", "第三帝国图文史", "证之于：爱", "魔窟：日本细菌部队的可怕真相", "朱可夫元帅战争回忆录", "奇怪的战败", "战争风云", "中国空军抗战记忆", "空中英豪", "日本军国主义侵华资料长编", "凯恩舰哗变", "抗战机密档中日军队轻武器史料", "第二次世界大战的起源", "二战最后五天", "孪生姐妹", "天堂里的小提琴", "第二次世界大战的起源", "原子弹秘史（上下册）", "上海1937：法新社记者眼中的淞沪会战", "第二次世界大战史", "盖世太保枪口下的中国女人", "科莱利上尉的曼陀铃", "未列入名册", "闪击英雄", "我的反间谍生涯", "第二次世界大战史", "杜鲁门回忆录(上下)", "二战期间日本情报失误研究及思考", "小机枪手", "日本大败局", "军情六处", "飞行员", "纳粹德国的兴亡", "北方的孤独女王", "坚不可摧", "坦克战", "美国电子战史", "食人魔窟．日本关东军细菌战部队的恐怖内幕", "我是大卫", "艾森豪威尔回忆录", "古德里安将军战争回忆录", "开往伊斯坦布尔的最后列车", "战争从未如此热血1", "秘密", "麦克阿瑟回忆录", "最后一百天", "我的母亲是纳粹", "东京审判", "天皇的皇上有五颗星", "英伦情书", "攻克柏林", "Slaughterhouse-Five", "回忆与思考", "第二次世界大战的重大战役", "日本帝国的衰亡", "军事学说的来源", "二战全史大全集", "诺曼底的六支军队", "山本五十六", "石之花(01)", "They Thought They Were Free", "纳粹集中营里的少女", "二战风云2", "与敌共眠", "战争从未如此热血4", "巴顿将军", "为了忘却的胜利", "奥斯威辛之后", "起飞：柏林的指令", "广岛", "安妮日记", "留德十年", "法兰西组曲", "赎罪", "二战史", "他们以为他们是自由的", "银翼夜枭01：暗夜女巫", "南京大屠杀", "中国之翼", "查无此人", "坚不可摧", "最长的一天", "1944：松山战役笔记", "回形针行动", "与魔鬼同行", "幼狮（上、下册）", "白云飞渡", "沙漠之狐隆美尔(上下)", "The Second World War", "保卫斯大林格勒", "安妮日记", "骷髅的证词", "麦克阿瑟", "桂河大桥", "闪击先锋", "欧洲最危险的男人", "第二次世界大战的决定性战役", "台湾慰安妇", "再见，黑暗", "太平洋战争(上)", "帝国骑士（第4卷）", "斯大林", "军人不是天生的（上下卷）", "工业人的未来-德鲁克管理经典", "第二次世界大战", "纵有千人倒下", "大海战", "莱特湾大海战", "疯狂科学家大本营", "With the Old Breed", "第二次中日战争史", "Alan Turing", "斯大林格勒1942", "生死狙击", "战争魔术师", "隆美尔", "拉贝日记", "中国战线从军记", "希特勒万岁，猪死了！", "Le Grand Duc", "从战争到战争", "活着回家", "我知道的老兵故事", "勒热夫绞肉机", "飞翔在中国上空", "左尔格在中国的秘密使命", "次元艦隊(01)", "何谓中日战争？", "二战十大著名战役", "隆美尔", "中日拉孟决战揭秘——异国的鬼", "希特勒这样输掉了二战", "希特勒（上下）", "魏特琳日记", "真相", "破解希特勒", "纳粹德国的兴亡（上中下）", "不是所有吉普都叫JEEP", "Jochen Peiper", "彼时", "像自由一样美丽", "这里的黎明静悄悄……", "Forgotten Ally", "偽軍", "无畏之海", "一寸河山一寸血.1", "八月炮火", "“神国”日本荒唐的决战生活", "安妮日记", "二战简史", "大屠杀", "德意志的另一行泪", "希特勒传（上下册）", "南京浩劫", "断剑", "失焦", "战争时期日本精神史", "流浪的星星", "第二次世界大战回忆录（全六卷）", "鼠族（新译本）", "国殇", "最长的一天", "失去的胜利", "布伦迪巴", "恶魔的饱食", "穿条纹衣服的男孩", "浩瀚大洋是赌场", "被遗忘的士兵", "夜", "飞虎队队员眼中的中国", "回来的路", "南京大屠杀", "德国式英雄", "朗读者", "战争就是这么回事儿（上）", "第三帝国的语言", "巴黎烧了吗？", "战败之夏", "有一类战犯叫参谋", "灭绝的年代", "德语课", "最后一役", "Unbroken", "南京安魂曲", "法兰西组曲", "密码传奇", "泥泞中的老虎", "生命不息·归来", "莎拉的钥匙"};

        List<String> bookList = Arrays.asList(bookArray);
        long count = 0;
        long startTime = System.currentTimeMillis();
        for (int i = 0; i < 1000000; i++) {
            for (String s : bookList) {
                if (s.length() > 10) count++;
            }
        }

        long endTime = System.currentTimeMillis();
        System.out.println("程序运行时间： " + (endTime - startTime) + "ms");

        long startTime1 = System.currentTimeMillis();
        for (int i = 0; i < 1000000; i++) {
            count = bookList.stream().filter(w -> w.length() > 10).count();
        }
        long endTime1 = System.currentTimeMillis();
        System.out.println("程序运行时间： " + (endTime1 - startTime1) + "ms");


        long startTime2 = System.currentTimeMillis();
        for (int i = 0; i < 1000000; i++) {
            for (String s : bookArray) {
                if (s.length() > 10) count++;
            }
        }

        long endTime2 = System.currentTimeMillis();
        System.out.println("程序运行时间： " + (endTime2 - startTime2) + "ms");

        long startTime3 = System.currentTimeMillis();
        for (int i = 0; i < 1000000; i++) {
            count= Arrays.stream(bookArray).filter(w -> w.length() > 10).count();
        }
        long endTime3 = System.currentTimeMillis();
        System.out.println("程序运行时间： " + (endTime3 - startTime3) + "ms");

        long startTime4 = System.currentTimeMillis();
        for (int i = 0; i < 1000000; i++) {
            count = bookList.parallelStream().filter(w -> w.length() > 10).count();
        }
        long endTime4 = System.currentTimeMillis();
        System.out.println("程序运行时间： " + (endTime4 - startTime4) + "ms");

        long startTime5 = System.currentTimeMillis();
        for (int i = 0; i < 1000000; i++) {
            count = java.util.stream.Stream.of(bookArray).filter(w -> w.length() > 10).count();
        }
        long endTime5 = System.currentTimeMillis();
        System.out.println("程序运行时间： " + (endTime5 - startTime5) + "ms");
    }
}
